xrun(64): 23.09-s006: (c) Copyright 1995-2024 Cadence Design Systems, Inc.
TOOL:	xrun(64)	23.09-s006: Started on Dec 13, 2025 at 14:09:23 EST
xrun
	-64bit
	-v93
	-relax
	-access +rwc
	-R
	-cdslib cds.lib
	-logfile .//results/simulate.log
	-input ./scripts/run.tcl
	-gui
xmsim: *W,NOMTDGUI: Multi-Threaded Dumping is disabled for interactive debug mode.

-------------------------------------
Relinquished control to SimVision...
xcelium> # scripts/run.tcl
xcelium> 
xcelium> # Where to store waveforms
xcelium> set SIM_RESULTS_DIR ./results
./results
xcelium> 
xcelium> # Make sure the directory exists
xcelium> if {![file isdirectory $SIM_RESULTS_DIR]} {
>     file mkdir $SIM_RESULTS_DIR
> }
xcelium> 
xcelium> # Open waveform database
xcelium> database -open $SIM_RESULTS_DIR/waves -default
Created default SHM database ./results/waves
xcelium> 
xcelium> # Probe signals recursively from the top-level instance
xcelium> probe -create -all -depth all
Created probe 1
xcelium> 
xcelium> # Run the simulation for 100 ns
xcelium> run 500 ns
Simulation complete via $finish(1) at time 140 NS + 0
../RTL/tb/tb_32bit_alu_behavioral.v:39         $finish;
xcelium> 
xcelium> # Close the waveform database (explicitly specify the database name)
xcelium> database -close $SIM_RESULTS_DIR/waves
xcelium> 
xcelium> # Exit the simulation
xcelium> exit
TOOL:	xrun(64)	23.09-s006: Exiting on Dec 13, 2025 at 14:15:20 EST  (total: 00:05:57)
