# ####################################################################

#  Created by Genus(TM) Synthesis Solution 21.17-s066_1 on Sat Dec 13 14:18:32 EST 2025

# ####################################################################

set sdc_version 2.0

set_units -capacitance 1000fF
set_units -time 1000ps

# Set the current design
current_design alu_32bit_behavioral

create_clock -name "clk" -period 1000.0 -waveform {0.0 500.0} 
set_load -pin_load 4.0 [get_ports {f[31]}]
set_load -pin_load 4.0 [get_ports {f[30]}]
set_load -pin_load 4.0 [get_ports {f[29]}]
set_load -pin_load 4.0 [get_ports {f[28]}]
set_load -pin_load 4.0 [get_ports {f[27]}]
set_load -pin_load 4.0 [get_ports {f[26]}]
set_load -pin_load 4.0 [get_ports {f[25]}]
set_load -pin_load 4.0 [get_ports {f[24]}]
set_load -pin_load 4.0 [get_ports {f[23]}]
set_load -pin_load 4.0 [get_ports {f[22]}]
set_load -pin_load 4.0 [get_ports {f[21]}]
set_load -pin_load 4.0 [get_ports {f[20]}]
set_load -pin_load 4.0 [get_ports {f[19]}]
set_load -pin_load 4.0 [get_ports {f[18]}]
set_load -pin_load 4.0 [get_ports {f[17]}]
set_load -pin_load 4.0 [get_ports {f[16]}]
set_load -pin_load 4.0 [get_ports {f[15]}]
set_load -pin_load 4.0 [get_ports {f[14]}]
set_load -pin_load 4.0 [get_ports {f[13]}]
set_load -pin_load 4.0 [get_ports {f[12]}]
set_load -pin_load 4.0 [get_ports {f[11]}]
set_load -pin_load 4.0 [get_ports {f[10]}]
set_load -pin_load 4.0 [get_ports {f[9]}]
set_load -pin_load 4.0 [get_ports {f[8]}]
set_load -pin_load 4.0 [get_ports {f[7]}]
set_load -pin_load 4.0 [get_ports {f[6]}]
set_load -pin_load 4.0 [get_ports {f[5]}]
set_load -pin_load 4.0 [get_ports {f[4]}]
set_load -pin_load 4.0 [get_ports {f[3]}]
set_load -pin_load 4.0 [get_ports {f[2]}]
set_load -pin_load 4.0 [get_ports {f[1]}]
set_load -pin_load 4.0 [get_ports {f[0]}]
set_load -pin_load 4.0 [get_ports cout]
set_clock_gating_check -setup 0.0 
set_input_delay -clock [get_clocks clk] -add_delay 0.01 [get_ports {sel[0]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.01 [get_ports {sel[1]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.01 [get_ports {sel[2]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.01 [get_ports {sel[3]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.01 [get_ports cin]
set_input_delay -clock [get_clocks clk] -add_delay 0.01 [get_ports {b[0]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.01 [get_ports {b[1]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.01 [get_ports {b[2]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.01 [get_ports {b[3]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.01 [get_ports {b[4]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.01 [get_ports {b[5]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.01 [get_ports {b[6]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.01 [get_ports {b[7]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.01 [get_ports {b[8]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.01 [get_ports {b[9]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.01 [get_ports {b[10]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.01 [get_ports {b[11]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.01 [get_ports {b[12]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.01 [get_ports {b[13]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.01 [get_ports {b[14]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.01 [get_ports {b[15]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.01 [get_ports {b[16]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.01 [get_ports {b[17]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.01 [get_ports {b[18]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.01 [get_ports {b[19]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.01 [get_ports {b[20]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.01 [get_ports {b[21]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.01 [get_ports {b[22]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.01 [get_ports {b[23]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.01 [get_ports {b[24]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.01 [get_ports {b[25]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.01 [get_ports {b[26]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.01 [get_ports {b[27]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.01 [get_ports {b[28]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.01 [get_ports {b[29]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.01 [get_ports {b[30]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.01 [get_ports {b[31]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.01 [get_ports {a[0]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.01 [get_ports {a[1]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.01 [get_ports {a[2]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.01 [get_ports {a[3]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.01 [get_ports {a[4]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.01 [get_ports {a[5]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.01 [get_ports {a[6]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.01 [get_ports {a[7]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.01 [get_ports {a[8]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.01 [get_ports {a[9]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.01 [get_ports {a[10]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.01 [get_ports {a[11]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.01 [get_ports {a[12]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.01 [get_ports {a[13]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.01 [get_ports {a[14]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.01 [get_ports {a[15]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.01 [get_ports {a[16]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.01 [get_ports {a[17]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.01 [get_ports {a[18]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.01 [get_ports {a[19]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.01 [get_ports {a[20]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.01 [get_ports {a[21]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.01 [get_ports {a[22]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.01 [get_ports {a[23]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.01 [get_ports {a[24]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.01 [get_ports {a[25]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.01 [get_ports {a[26]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.01 [get_ports {a[27]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.01 [get_ports {a[28]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.01 [get_ports {a[29]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.01 [get_ports {a[30]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.01 [get_ports {a[31]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.03 [get_ports cout]
set_output_delay -clock [get_clocks clk] -add_delay 0.03 [get_ports {f[0]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.03 [get_ports {f[1]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.03 [get_ports {f[2]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.03 [get_ports {f[3]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.03 [get_ports {f[4]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.03 [get_ports {f[5]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.03 [get_ports {f[6]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.03 [get_ports {f[7]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.03 [get_ports {f[8]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.03 [get_ports {f[9]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.03 [get_ports {f[10]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.03 [get_ports {f[11]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.03 [get_ports {f[12]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.03 [get_ports {f[13]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.03 [get_ports {f[14]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.03 [get_ports {f[15]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.03 [get_ports {f[16]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.03 [get_ports {f[17]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.03 [get_ports {f[18]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.03 [get_ports {f[19]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.03 [get_ports {f[20]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.03 [get_ports {f[21]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.03 [get_ports {f[22]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.03 [get_ports {f[23]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.03 [get_ports {f[24]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.03 [get_ports {f[25]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.03 [get_ports {f[26]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.03 [get_ports {f[27]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.03 [get_ports {f[28]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.03 [get_ports {f[29]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.03 [get_ports {f[30]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.03 [get_ports {f[31]}]
set_max_fanout 5.000 [get_ports {a[31]}]
set_max_fanout 5.000 [get_ports {a[30]}]
set_max_fanout 5.000 [get_ports {a[29]}]
set_max_fanout 5.000 [get_ports {a[28]}]
set_max_fanout 5.000 [get_ports {a[27]}]
set_max_fanout 5.000 [get_ports {a[26]}]
set_max_fanout 5.000 [get_ports {a[25]}]
set_max_fanout 5.000 [get_ports {a[24]}]
set_max_fanout 5.000 [get_ports {a[23]}]
set_max_fanout 5.000 [get_ports {a[22]}]
set_max_fanout 5.000 [get_ports {a[21]}]
set_max_fanout 5.000 [get_ports {a[20]}]
set_max_fanout 5.000 [get_ports {a[19]}]
set_max_fanout 5.000 [get_ports {a[18]}]
set_max_fanout 5.000 [get_ports {a[17]}]
set_max_fanout 5.000 [get_ports {a[16]}]
set_max_fanout 5.000 [get_ports {a[15]}]
set_max_fanout 5.000 [get_ports {a[14]}]
set_max_fanout 5.000 [get_ports {a[13]}]
set_max_fanout 5.000 [get_ports {a[12]}]
set_max_fanout 5.000 [get_ports {a[11]}]
set_max_fanout 5.000 [get_ports {a[10]}]
set_max_fanout 5.000 [get_ports {a[9]}]
set_max_fanout 5.000 [get_ports {a[8]}]
set_max_fanout 5.000 [get_ports {a[7]}]
set_max_fanout 5.000 [get_ports {a[6]}]
set_max_fanout 5.000 [get_ports {a[5]}]
set_max_fanout 5.000 [get_ports {a[4]}]
set_max_fanout 5.000 [get_ports {a[3]}]
set_max_fanout 5.000 [get_ports {a[2]}]
set_max_fanout 5.000 [get_ports {a[1]}]
set_max_fanout 5.000 [get_ports {a[0]}]
set_max_fanout 5.000 [get_ports {b[31]}]
set_max_fanout 5.000 [get_ports {b[30]}]
set_max_fanout 5.000 [get_ports {b[29]}]
set_max_fanout 5.000 [get_ports {b[28]}]
set_max_fanout 5.000 [get_ports {b[27]}]
set_max_fanout 5.000 [get_ports {b[26]}]
set_max_fanout 5.000 [get_ports {b[25]}]
set_max_fanout 5.000 [get_ports {b[24]}]
set_max_fanout 5.000 [get_ports {b[23]}]
set_max_fanout 5.000 [get_ports {b[22]}]
set_max_fanout 5.000 [get_ports {b[21]}]
set_max_fanout 5.000 [get_ports {b[20]}]
set_max_fanout 5.000 [get_ports {b[19]}]
set_max_fanout 5.000 [get_ports {b[18]}]
set_max_fanout 5.000 [get_ports {b[17]}]
set_max_fanout 5.000 [get_ports {b[16]}]
set_max_fanout 5.000 [get_ports {b[15]}]
set_max_fanout 5.000 [get_ports {b[14]}]
set_max_fanout 5.000 [get_ports {b[13]}]
set_max_fanout 5.000 [get_ports {b[12]}]
set_max_fanout 5.000 [get_ports {b[11]}]
set_max_fanout 5.000 [get_ports {b[10]}]
set_max_fanout 5.000 [get_ports {b[9]}]
set_max_fanout 5.000 [get_ports {b[8]}]
set_max_fanout 5.000 [get_ports {b[7]}]
set_max_fanout 5.000 [get_ports {b[6]}]
set_max_fanout 5.000 [get_ports {b[5]}]
set_max_fanout 5.000 [get_ports {b[4]}]
set_max_fanout 5.000 [get_ports {b[3]}]
set_max_fanout 5.000 [get_ports {b[2]}]
set_max_fanout 5.000 [get_ports {b[1]}]
set_max_fanout 5.000 [get_ports {b[0]}]
set_max_fanout 5.000 [get_ports cin]
set_max_fanout 5.000 [get_ports {sel[3]}]
set_max_fanout 5.000 [get_ports {sel[2]}]
set_max_fanout 5.000 [get_ports {sel[1]}]
set_max_fanout 5.000 [get_ports {sel[0]}]
set_drive 2.0 [get_ports {a[31]}]
set_drive 2.0 [get_ports {a[30]}]
set_drive 2.0 [get_ports {a[29]}]
set_drive 2.0 [get_ports {a[28]}]
set_drive 2.0 [get_ports {a[27]}]
set_drive 2.0 [get_ports {a[26]}]
set_drive 2.0 [get_ports {a[25]}]
set_drive 2.0 [get_ports {a[24]}]
set_drive 2.0 [get_ports {a[23]}]
set_drive 2.0 [get_ports {a[22]}]
set_drive 2.0 [get_ports {a[21]}]
set_drive 2.0 [get_ports {a[20]}]
set_drive 2.0 [get_ports {a[19]}]
set_drive 2.0 [get_ports {a[18]}]
set_drive 2.0 [get_ports {a[17]}]
set_drive 2.0 [get_ports {a[16]}]
set_drive 2.0 [get_ports {a[15]}]
set_drive 2.0 [get_ports {a[14]}]
set_drive 2.0 [get_ports {a[13]}]
set_drive 2.0 [get_ports {a[12]}]
set_drive 2.0 [get_ports {a[11]}]
set_drive 2.0 [get_ports {a[10]}]
set_drive 2.0 [get_ports {a[9]}]
set_drive 2.0 [get_ports {a[8]}]
set_drive 2.0 [get_ports {a[7]}]
set_drive 2.0 [get_ports {a[6]}]
set_drive 2.0 [get_ports {a[5]}]
set_drive 2.0 [get_ports {a[4]}]
set_drive 2.0 [get_ports {a[3]}]
set_drive 2.0 [get_ports {a[2]}]
set_drive 2.0 [get_ports {a[1]}]
set_drive 2.0 [get_ports {a[0]}]
set_drive 2.0 [get_ports {b[31]}]
set_drive 2.0 [get_ports {b[30]}]
set_drive 2.0 [get_ports {b[29]}]
set_drive 2.0 [get_ports {b[28]}]
set_drive 2.0 [get_ports {b[27]}]
set_drive 2.0 [get_ports {b[26]}]
set_drive 2.0 [get_ports {b[25]}]
set_drive 2.0 [get_ports {b[24]}]
set_drive 2.0 [get_ports {b[23]}]
set_drive 2.0 [get_ports {b[22]}]
set_drive 2.0 [get_ports {b[21]}]
set_drive 2.0 [get_ports {b[20]}]
set_drive 2.0 [get_ports {b[19]}]
set_drive 2.0 [get_ports {b[18]}]
set_drive 2.0 [get_ports {b[17]}]
set_drive 2.0 [get_ports {b[16]}]
set_drive 2.0 [get_ports {b[15]}]
set_drive 2.0 [get_ports {b[14]}]
set_drive 2.0 [get_ports {b[13]}]
set_drive 2.0 [get_ports {b[12]}]
set_drive 2.0 [get_ports {b[11]}]
set_drive 2.0 [get_ports {b[10]}]
set_drive 2.0 [get_ports {b[9]}]
set_drive 2.0 [get_ports {b[8]}]
set_drive 2.0 [get_ports {b[7]}]
set_drive 2.0 [get_ports {b[6]}]
set_drive 2.0 [get_ports {b[5]}]
set_drive 2.0 [get_ports {b[4]}]
set_drive 2.0 [get_ports {b[3]}]
set_drive 2.0 [get_ports {b[2]}]
set_drive 2.0 [get_ports {b[1]}]
set_drive 2.0 [get_ports {b[0]}]
set_drive 2.0 [get_ports cin]
set_drive 2.0 [get_ports {sel[3]}]
set_drive 2.0 [get_ports {sel[2]}]
set_drive 2.0 [get_ports {sel[1]}]
set_drive 2.0 [get_ports {sel[0]}]
set_wire_load_mode "enclosed"
